import React from 'react';
import './JSX_Grammer.css';

function JSX_Grammer() {
    
    // const name = '리액트'; // 실습 2, 실습 4
    // const name = '리악토'; // 실습 3
    const name = '파드 서핑데이 기대되시나요!'; // 실습 5

    return (
        // [ 실습 1 ]

        // wrong case
        //   <h1>리액트 안녕!</h1>
        //   <h1>잘 작동하니?</h1>

        // correct case
        // <div>
        //     <h1>리액트 안녕!</h1>
        //     <h1>잘 작동하니?</h1>
        // </div>

        // ------------------------------------------------------------

        // [ 실습 2 ]

        // <div>
        //     <h1>{name} 안녕!</h1>
        //     <h1>잘 작동하니?</h1>
        // </div>

        // ------------------------------------------------------------

        // [ 실습 3 ]

        // <div>
        //     {
        //     name === '리액트'
        //     ? (<h1>리액트입니다.</h1>)
        //     : (<h1>리액트가 아닙니다.</h1>)
        //     }
        // </div>


        // ------------------------------------------------------------

        // [ 실습 4 ]
        
        // <div>
        //     {name && (<h1>name 변수가 있습니다.</h1>)}
        //     <h1>우리는 {name || 'html'}를 사용합니다.</h1>
        // </div>

        // ------------------------------------------------------------

        // [ 실습 5 ]

        // <div className='react'>{name}</div>

        // ------------------------------------------------------------

        // [ 실습 6 ]
        <>
            <div
                className='react'
                // 태그 속성 안에서도 주석을 사용할 수 있다. 
                // 이 경우 주석은 속성 값들 사이에 작성된다.
            >
                {name}
                {/* 
                    태그 내부에서 주석을 작성할 때는 중괄호 `{}`를 사용해야 한다.
                    JSX는 중괄호 안에 표현식을 넣을 수 있기 때문에, 주석도 중괄호 안에서 변수처럼 사용되어야 한다.
                */}

                {/* [1] 시작태그와 끝태그 사이에서 작성할 때에는 이와 같이 주석을 사용해야 한다. */}
                { 
                    // [2] 이렇게 단일 문장으로도 사용 가능하다.
                    
                    /*
                        [3] 이렇게 여러 문장으로도 사용 가능하다.
                        [3] 이렇게 여러 문장으로도 사용 가능하다.
                    */
                }
                {/* 
                    일반적인 주석과는 달리, 이 주석은 태그 내부에 있으므로,
                    브라우저가 렌더링할 때 화면에 보이지 않는다.
                    만약 중괄호를 사용하지 않으면 화면에 그대로 표시되게 된다.
                */}
                // 줄괄호를 사용하지 않으면 화면에 그대로 표시되게 된다.
            </div>
        </>
    );
}

export default JSX_Grammer;
